---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CutFailures.CutExactlyHalf
source: html/76802927-a1c9-5df6-b32f-b975083292c3.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CutFailures.CutExactlyHalf Property

Can't cut in half. Move plane towards either end.

## Syntax (C#)
```csharp
public static FailureDefinitionId CutExactlyHalf { get; }
```